# Brewfile — MacBook Pro (Personal)
#
# Reconciled 2026-05-25 against `brew bundle dump` on AM2 (host=AM2, M2 Pro)
# during plan 0007 Phase 3. Reflects actual brew-managed state.
#
# Run from this directory:  brew bundle
# Check drift without writes:  brew bundle check --verbose
# Update from current state:  brew bundle dump --file=/tmp/Brewfile.dump --force --describe
#   (always dump to /tmp first, never overwrite this file directly — comments
#    and structure get clobbered by --force)
#
# Idempotent: re-running `brew bundle` is safe. Entries already installed are skipped.
#
# Natively-installed apps (drag-to-Applications, Adobe Creative Cloud, etc.)
# live in environment/apps-manual.md, NOT here. See plan 0007 Phase 4.

# ── Taps ──────────────────────────────────────────────────────────
tap "haimgel/tools"              # for display_switch
tap "waydabber/betterdisplay"    # for betterdisplaycli (the BetterDisplay app itself is installed natively)

# ── CLI: shell + prompt ───────────────────────────────────────────
brew "bash"                      # newer bash than the macOS-bundled one
brew "powerlevel10k"             # zsh theme (plan 0003)

# ── CLI: dev essentials ───────────────────────────────────────────
brew "git"                       # newer git than Xcode CLT
brew "gh"                        # GitHub CLI (issues, PRs, label setup per CLAUDE.md)
brew "fnm"                       # Fast Node Manager (sources the npm globals declared below)
brew "mas"                       # Mac App Store CLI (`mas list` still useful; see note below re: `mas install`)
brew "gitleaks"                  # secret scanner (plan 0007 Phase 2f)

# ── CLI: modern unix replacements ─────────────────────────────────
brew "ripgrep"                   # rg — fast grep
brew "fd"                        # find replacement
brew "bat"                       # cat with syntax highlighting
brew "eza"                       # ls replacement
brew "fzf"                       # fuzzy finder
brew "jq"                        # JSON processor
brew "yq"                        # YAML processor
brew "tree"                      # directory tree view
brew "wget"                      # HTTP/FTP fetcher
brew "htop"                      # interactive process viewer

# ── CLI: language runtimes ────────────────────────────────────────
brew "python@3.12"               # explicit pin; tools (uvx, etc.) follow

# ── WeasyPrint native libs (for syntheus repo's /contract PDF pipeline) ──
# Per syntheus CLAUDE.md: WeasyPrint needs Homebrew native libs at
# /opt/homebrew/lib; venv lives at ~/.syntheus/weasyprint-venv.
# `pango` is also declared below under media/photo — brew dedupes safely.
brew "cairo"
brew "fontconfig"
brew "glib"
brew "harfbuzz"

# ── CLI: media / photo ────────────────────────────────────────────
brew "ffmpeg"                    # audio/video transcoding
brew "pango"                     # i18n text layout (transitive but pinned)
brew "poppler"                   # PDF rendering
brew "wimlib"                    # Windows Imaging Format support (for PC tooling)
brew "immich-cli"                # Immich photo manager CLI (plans 0002, 0005)

# ── CLI: security / secrets ───────────────────────────────────────
brew "bitwarden-cli"             # `bw` — Bitwarden command-line

# ── CLI: system / maintenance ─────────────────────────────────────
brew "mole"                      # deep clean + optimize the Mac (CLI; GUI sibling = `mole-app` cask below)

# ── Display switching (USB-C KVM via DDC/CI; plan 0008) ───────────
brew "m1ddc"                     # underlying DDC/CI control for Apple Silicon
brew "haimgel/tools/display_switch"  # watches USB connect/disconnect → switches monitor input
brew "waydabber/betterdisplay/betterdisplaycli"  # CLI invoked by display_switch's .ini hooks.
                                  # NOTE: no bottle published — formula compiles from source
                                  # via Swift, so full Xcode (>=14) is required. The Homebrew
                                  # cask shim at /opt/homebrew/bin/betterdisplaycli (from the
                                  # BetterDisplay app cask) is a different artifact — a bare
                                  # exec to the GUI app binary — and is NOT a substitute for
                                  # this formula. See plan 0008 + apps-manual.md.

# ── Casks (truly brew-managed) ────────────────────────────────────
cask "font-meslo-lg-nerd-font"   # required for p10k icons (plan 0003)
cask "ghostty"                   # terminal emulator (plan 0003)
cask "mole-app"                  # GUI version of `brew "mole"` (same upstream project, tw93/Mole)
cask "slack"                     # vendor cask; replaces App Store install (auto-updates without App Store)

# ── App Store apps ────────────────────────────────────────────────
# `mas install` is broken on macOS 26.5 (requires sudo + several ADAM IDs return
# "No apps found"). Mac App Store apps are now installed manually via the App
# Store app and documented in environment/apps-manual.md. `mas list` (above) is
# still useful for auditing what's installed.
#
# Removed from this Brewfile (2026-05-25 during AM5 onboarding): Blackmagic Disk
# Speed Test, Fantastical, GarageBand, Harvest, iMovie, Keynote, Meeter,
# NordVPN, Numbers, Pages, Paprika Recipe Manager 3, Shazam, The Unarchiver.
# See apps-manual.md > Mac App Store apps.
# (Slack was in this list originally but moved back to a vendor cask above on
# 2026-05-26 — see `cask "slack"`.)

# ── NPM globals (via Brewfile's `npm` syntax; requires fnm-managed node) ──
npm "@google/gemini-cli"         # Gemini CLI
npm "@openai/codex"              # Codex CLI
npm "planpong"                   # plan adversarial review (this repo uses it)
npm "vercel"                     # Vercel CLI

# ── NOT brew-managed (intentional — see environment/apps-manual.md) ──
# Natively-installed apps and Adobe Creative Cloud sub-apps live in
# apps-manual.md with install URLs + setup notes. They are NOT declared here.
# Examples:
#   - Brave Browser, Spotify, Raycast, Figma, WhatsApp, Spark Desktop
#   - VS Code (currently native; could be moved to `cask "visual-studio-code"` via --adopt)
#   - Google Drive for Desktop
#   - Adobe Creative Cloud + Lightroom CC + Illustrator 2026
#   - Claude.app (Anthropic native installer)
#   - Codex.app (OpenAI native installer)
#   - macOS-bundled (Safari, etc.)
